# Import Dependencies

In [189]:
from pathlib import Path
import os
import numpy as np
import pandas as pd
# E:/Doc/Learn/ML Bootcamp/Data analysis/exercise/HW10/tennis_data_20231212/

# Dataset Loading

In [190]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/event")
event_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
    )

In [111]:
event_df.head()

,match_id,first_to_serve,home_team_seed,away_team_seed,custom_id,winner_code,default_period_count,start_datetime,match_slug,final_result_only
0,11673958,None,1,4,JgdbspFNb,2,3,1696094700,tirante-barrios-vera,False
1,11673962,None,4,None,pFNbsHbwc,1,3,1696176000,heide-tirante,False
2,11673963,None,None,None,fTxsHbwc,1,3,1696087800,heide-jorda-sanchis,False
3,11673993,None,None,Q,axvsGQHb,2,3,1696154400,ajdukovic-roca-batalla,False
4,11674000,None,Q,WC,QjHshlKb,2,3,1696086000,crawford-escobedo,False

In [8]:
data_dir = Path("tennis_data_20231212/raw_votes_parquet")
vote_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [9]:
vote_df.head()

   match_id  home_vote  away_vote
0  11673958        554        233
1  11673962        909        213
2  11673963        399        213
3  11673993        744        208
4  11674000        461        320

In [10]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/tournament")
tournament_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [11]:
tournament_df.head()

,match_id,tournament_id,tournament_name,tournament_slug,tournament_unique_id,tournament_category_name,tournament_category_slug,user_count,ground_type,tennis_points,has_event_player_statistics,crowd_sourcing_enabled,has_performance_graph_feature,display_inverse_home_away_teams,priority,competition_type
0,11673958,121441,"Bogota, Colombia",bogota-colombia,None,Challenger,challenger,125,Red clay,125,False,False,False,False,0,2
1,11673962,121441,"Bogota, Colombia",bogota-colombia,None,Challenger,challenger,125,Red clay,125,False,False,False,False,0,2
2,11673963,121441,"Bogota, Colombia",bogota-colombia,None,Challenger,challenger,125,Red clay,125,False,False,False,False,0,2
3,11673993,121451,"Braga, Portugal",braga-portugal,None,Challenger,challenger,163,Red clay,75,False,False,False,False,0,2
4,11674000,121453,"Charleston, USA",charleston-usa,None,Challenger,challenger,71,Hardcourt outdoor,75,False,False,False,False,0,2

In [12]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/season")
season_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [13]:
season_df.head()

,match_id,season_id,name,year
0,11673958,52736,"ATP Challenger Bogota, Colombia Men Singles 2023",2023
1,11673962,52736,"ATP Challenger Bogota, Colombia Men Singles 2023",2023
2,11673963,52736,"ATP Challenger Bogota, Colombia Men Singles 2023",2023
3,11673993,53163,"ATP Challenger Braga, Portugal Men Singles 2023",2023
4,11674000,52758,"ATP Challenger Charleston, SC, USA Men Singles...",2023

In [14]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/round")
round_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [109]:
round_df.head()

   match_id  round_id       name       slug cup_round_type
0  11673958        28  Semifinal  semifinal              2
1  11673962        29      Final      final              1
2  11673963        28  Semifinal  semifinal              2
3  11673993        29      Final      final              1
4  11674000        28  Semifinal  semifinal              2

In [16]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/venue")
venue_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [17]:
venue_df.head()

   match_id        city         stadium  venue_id   country
0  11673958      Bogota  Cancha Central     18338  Colombia
1  11673962      Bogota  Cancha Central     18338  Colombia
2  11673963      Bogota  Cancha Central     18338  Colombia
3  11673993       Braga   Court Central     21510  Portugal
4  11674000  Charleston    Center Court     32522       USA

In [192]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/home")
home_team_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

C:\Users\amine\AppData\Local\Temp\ipykernel_10732\322055348.py:2: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  home_team_df = pd.concat(

In [193]:
home_team_df.head()

,match_id,name,slug,gender,user_count,residence,birthplace,height,weight,plays,turned_pro,current_prize,total_prize,player_id,current_rank,name_code,country,full_name
0,11673958,Barrios Vera T.,barrios-vera-tomas,M,2915,Santiago,"Chillan, Chile",1.91,83,right-handed,2014,265608,646273,132834,103,BAR,Chile,"Barrios Vera, Tomás"
1,11673962,Tirante T.,tirante-thiago-agustin,M,1519,La Plata,"La Plata, Argentina",1.85,78,right-handed,None,249335,430793,221515,123,TIR,Argentina,"Tirante, Thiago Agustin"
2,11673963,Heide G.,heide-gustavo,M,1177,None,Sao Paulo,1.88,None,right-handed,None,36929,87230,302582,247,HEI,Brazil,"Heide, Gustavo"
3,11673993,Ajduković D.,ajdukovic-duje,M,1293,"Zagreb, Croatia","Split, Croatia",1.88,75,right-handed,None,63678,198866,207081,143,AJD,Croatia,"Ajduković, Duje"
4,11674000,Escobedo E.,escobedo-ernesto,M,680,"West Covina, CA, USA","Los Angeles, CA, USA",1.85,82,right-handed,2014,84375,1280430,80491,404,ESC,Mexico,"Escobedo, Ernesto"

In [194]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/away")
away_team_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

C:\Users\amine\AppData\Local\Temp\ipykernel_10732\2287544343.py:2: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  away_team_df = pd.concat(

In [21]:
away_team_df.head()

,match_id,name,slug,gender,user_count,residence,birthplace,height,weight,plays,turned_pro,current_prize,total_prize,player_id,current_rank,name_code,country,full_name
0,11673958,Tirante T.,tirante-thiago-agustin,M,1519,La Plata,"La Plata, Argentina",1.85,78,right-handed,None,249335,430793,221515,123,TIR,Argentina,"Tirante, Thiago Agustin"
1,11673962,Heide G.,heide-gustavo,M,1177,None,Sao Paulo,1.88,None,right-handed,None,36929,87230,302582,247,HEI,Brazil,"Heide, Gustavo"
2,11673963,Jorda Sanchis D.,jorda-sanchis-david,M,344,Spain,"Barcelona, Spain",1.98,83,right-handed,None,27028,72338,57155,331,JOR,Spain,"Jorda Sanchis, David"
3,11673993,Roca Batalla O.,roca-batalla-oriol,M,707,Santa Coloma de Gramenet,Barcelona,1.75,75,right-handed,None,53418,317311,51100,213,ROC,Spain,"Roca Batalla, Oriol"
4,11674000,Crawford O.,crawford-oliver,M,442,"Spartanburg, SC","Spartanburg, SC, USA",1.80,84,right-handed,None,40191,113045,213057,215,CRA,USA,"Crawford, Oliver"

In [22]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/home_score")
home_score_df = pd.concat(
   (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [23]:
home_score_df.head()

,match_id,current_score,display_score,period_1,period_2,period_3,period_4,period_5,period_1_tie_break,period_2_tie_break,period_3_tie_break,period_4_tie_break,period_5_tie_break,normal_time
0,11673958,0,0,2,4,None,None,None,None,None,None,None,None,None
1,11673962,None,None,None,None,None,None,None,None,None,None,None,None,None
2,11673963,2,2,7,6,None,None,None,None,None,None,None,None,None
3,11673993,1,1,6,1,1,None,None,None,None,None,None,None,None
4,11674000,0,0,4,1,None,None,None,None,None,None,None,None,None

In [24]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/away_score")
away_score_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [25]:
away_score_df.head()

,match_id,current_score,display_score,period_1,period_2,period_3,period_4,period_5,period_1_tie_break,period_2_tie_break,period_3_tie_break,period_4_tie_break,period_5_tie_break,normal_time
0,11673958,2,2,6,6,None,None,None,None,None,None,None,None,None
1,11673962,None,None,None,None,None,None,None,None,None,None,None,None,None
2,11673963,0,0,6,4,None,None,None,None,None,None,None,None,None
3,11673993,2,2,4,6,6,None,None,None,None,None,None,None,None
4,11674000,1,1,6,2,None,None,None,None,None,None,None,None,None

In [275]:
data_dir = Path("tennis_data_20231212/raw_match_parquet/time")
time_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [27]:
time_df.head()

,match_id,period_1,period_2,period_3,period_4,period_5,current_period_start_timestamp
0,11673958,1960,2457,None,None,None,1696097817
1,11673962,None,None,None,None,None,1696176527
2,11673963,3403,2431,None,None,None,1696091852
3,11673993,2894,2309,2084,None,None,1696160248
4,11674000,3177,None,None,None,None,1696089777

In [28]:
data_dir = Path("tennis_data_20231212/raw_odds_parquet")
odds_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [29]:
odds_df.head()  # multi values

,match_id,market_id,market_name,is_live,suspended,initial_fractional_value,fractional_value,choice_name,choice_source_id,winnig,change
0,11673958,1,full_time,False,False,73/100,83/100,1,1349454568,False,1
1,11673958,1,full_time,False,False,1/1,83/100,2,1349454681,True,-1
2,11673958,11,first_set_winner,False,False,8/11,5/6,1,1349620691,False,1
3,11673958,11,first_set_winner,False,False,1/1,5/6,2,1349620754,True,-1
4,11673958,12,total_games_won,False,False,4/5,4/5,Over,1349620653,False,0

In [30]:
data_dir = Path("tennis_data_20231212/raw_tennis_power_parquet")
tennis_power_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [31]:
tennis_power_df.head()  # multi values

   match_id  set_num  game_num  value  break_occurred
0  11674074        1         1  30.50           False
1  11674074        1         2  81.10            True
2  11674074        1         3  51.60           False
3  11674074        1         4 -33.80           False
4  11674074        1         5 -59.88            True

In [32]:
data_dir = Path("tennis_data_20231212/raw_point_by_point_parquet")
point_by_point_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [33]:
point_by_point_df.head()  # GameInfo table in diagram but it has 3 columns more(3 last ones) - multi values

,match_id,set_id,game_id,point_id,home_point,away_point,point_description,home_point_type,away_point_type,home_score,away_score,serving,scoring
0,11674074,2,7,0,0,15,2,5,1,6,1,1,1
1,11674074,2,7,1,0,30,0,5,1,6,1,1,1
2,11674074,2,7,2,15,30,1,1,5,6,1,1,1
3,11674074,2,7,3,30,30,0,1,5,6,1,1,1
4,11674074,2,7,4,40,30,0,3,5,6,1,1,1

In [34]:
data_dir = Path("tennis_data_20231212/raw_statistics_parquet")
statistics_df = pd.concat(
    (pd.read_parquet(parquet_file) for parquet_file in data_dir.glob('*.parquet')), ignore_index=True
)

In [35]:
statistics_df.head() # periodInfo table in diagram - multi values

,match_id,period,statistic_category_name,statistic_name,home_stat,away_stat,compare_code,statistic_type,value_type,home_value,away_value,home_total,away_total
0,11674074,ALL,service,aces,1,2,2,positive,event,1,2,NaN,NaN
1,11674074,ALL,service,double_faults,1,3,2,negative,event,1,3,NaN,NaN
2,11674074,ALL,service,first_serve,34/52 (65%),26/57 (46%),1,positive,team,34,26,52.0,57.0
3,11674074,ALL,service,second_serve,17/18 (94%),28/31 (90%),1,positive,team,17,28,18.0,31.0
4,11674074,ALL,service,first_serve_points,25/34 (74%),11/26 (42%),1,positive,team,25,11,34.0,26.0

In [36]:
# Q1 How many tennis players are included in the dataset?
total_players = pd.concat([home_team_df["player_id"], away_team_df["player_id"]]).unique().shape[0]
total_players
# away_team_df["player_id"]

596

In [37]:
# Q2 What is the average age of the players? => average age of becoming pro
away_team_int = away_team_df[~away_team_df["turned_pro"].isna()]["turned_pro"].astype(int)
home_team_int = home_team_df[~home_team_df["turned_pro"].isna()]["turned_pro"].astype(int)
become_professional_mean = pd.concat([home_team_int, away_team_int]).mean()
become_professional_mean

2012.014705882353

In [38]:
# Q3 Which player has the highest number of wins?

home_winner = event_df[event_df["winner_code"] == 1]["match_id"]
away_winner = event_df[event_df["winner_code"] == 2]["match_id"]
home_winner_names = pd.merge(home_team_df[["match_id", "full_name"]], home_winner)
away_winner_names = pd.merge(away_team_df[["match_id", "full_name"]], away_winner)
total_winners = pd.merge(home_winner_names, away_winner_names, how="outer")
total_winners.groupby("full_name").agg(number_of_wins = 
                                       ("full_name","count")).sort_values("number_of_wins", ascending=False).head()

                          number_of_wins
full_name
Milushev, Plamen                       3
Panaras, Adam                          3
Kalina, Vit                            3
Mouilleron Salvo, Manuel               2
Fery, Arthur                           2

In [266]:
# Q4 What is the longest match recorded in terms of duration?
time_df["sum_of_durations"] = (time_df["period_1"].fillna(0) + time_df["period_2"].fillna(0) + time_df["period_3"].fillna(0) +
                            time_df["period_4"].fillna(0) + time_df["period_5"].fillna(0))
time_df[["match_id","sum_of_durations"]].sort_values("sum_of_durations", ascending=False).head(3)

     match_id  sum_of_durations
331  11699235             12835
39   11697113             11123
300  11699173             11060

In [40]:
# Q5 How many sets are typically played in a tennis match?
mean_set_per_match = home_score_df[[ "period_1", "period_2", "period_3", "period_4", "period_5"]].notnull().sum(axis=1).mean()
mean_set_per_match

2.181937172774869

In [51]:
# Q6 Which country has produced the most successful tennis players?
home_winner = event_df[event_df["winner_code"] == 1]["match_id"] #home winner code is 1
away_winner = event_df[event_df["winner_code"] == 2]["match_id"]
home_winner_names = pd.merge(home_team_df[["match_id", "full_name", "country"]], home_winner)
away_winner_names = pd.merge(away_team_df[["match_id", "full_name", "country"]], away_winner)
total_winners = pd.merge(home_winner_names, away_winner_names, how="outer")
total_winners.groupby("country").agg(number_of_players=("country","count")).sort_values(
    "number_of_players", ascending=False).head(5)

           number_of_players
country
France                    55
Italy                     39
Australia                 30
Argentina                 29
USA                       27

In [67]:
# Q7 What is the average number of aces per match?
statistics_aces_df = statistics_df[(statistics_df["period"] == "ALL") & (statistics_df["statistic_name"] == "aces")]
statistics_aces_df["total_aces"] = statistics_aces_df["home_value"] + statistics_aces_df["away_value"]
statistics_aces_df["total_aces"].mean().round(2)

C:\Users\amine\AppData\Local\Temp\ipykernel_10732\3489759979.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  statistics_aces_df["total_aces"] = statistics_aces_df["home_value"] + statistics_aces_df["away_value"]

4.01

In [107]:
# Q8 Is there a difference in the number of double faults based on gender?
statistics_double_faults_df = statistics_df[(statistics_df["period"] == "ALL") & 
                                            (statistics_df["statistic_name"] == "double_faults")] #

statistics_double_faults_df["total_double_faults"] =  (statistics_double_faults_df["home_value"] + 
                                                       statistics_double_faults_df["away_value"]) #total fault per match

total_double_faults_df = statistics_double_faults_df[["match_id", "total_double_faults"]]


total_players = pd.merge(away_team_df[["match_id","gender"]], home_team_df[["match_id","gender"]], how="outer") # merge to have all players


pd.merge(total_double_faults_df, total_players).groupby(
    "gender").agg(double_faults_average=("total_double_faults","mean")).round(2)

C:\Users\amine\AppData\Local\Temp\ipykernel_10732\3715241419.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  statistics_double_faults_df["total_double_faults"] =  (statistics_double_faults_df["home_value"] +

        double_faults_average
gender
F                        7.56
M                        5.34

In [188]:
# Q9 Which player has won the most tournaments in a single month?
final_matches_id = round_df[round_df["slug"] == "final"][["match_id","slug"]] #which match is final
final_winners_and_dates = pd.merge(final_matches_id,event_df)[["match_id","winner_code","start_datetime"]]
final_winners_and_dates["start_datetime"] = pd.to_datetime(final_winners_and_dates["start_datetime"], unit='s').dt.to_period('M') # month of final
home_winner = final_winners_and_dates[final_winners_and_dates["winner_code"] == 1] # home winner
away_winner = final_winners_and_dates[final_winners_and_dates["winner_code"] == 2] # away winner
home_winner_player_names = pd.merge(home_winner["match_id"], home_team_df)[["match_id","full_name"]] # home winner name
away_winner_player_names = pd.merge(away_winner["match_id"], away_team_df)[["match_id","full_name"]]
total_winners_name = pd.merge(pd.merge(home_winner, home_winner_player_names), pd.merge(away_winner, away_winner_player_names), how="outer")
total_winners_name.groupby(["start_datetime", "full_name"]).agg(number_of_wins=("full_name","count")).head()
# because we have just one month and all of players won just one tournament.

                                     number_of_wins
start_datetime full_name
2023-10        Bartunkova, Nikola                 1
               Biolay, Sophia                     1
               Cid Subervi, Roberto               1
               Draxl, Liam                        1
               Gaubas, Vilius                     1

In [260]:
# Q10 Is there a correlation between a player's height and their ranking?
total_players = pd.merge(home_team_df[["slug", "gender", "height", "current_rank"]], away_team_df[["slug", "gender", "height", "current_rank"]], how="outer")
# data cleaning - duplicated
total_players.duplicated().sum() # there are 167 duplicated rows
total_players = total_players.drop_duplicates().reset_index(drop=True) # remove duplicates and reset index

total_female_players = total_players[total_players["gender"] == "F"]  # female df
total_male_players = total_players[total_players["gender"] == "M"] # male df

# data cleaning - drop nan
total_male_players[total_male_players.isna().any(axis=1)] #75 nan in height
total_female_players[total_female_players.isna().any(axis=1)] #182 nan in height
total_male_players[total_male_players["current_rank"].isna()] #3 nan in rank
total_male_players = total_male_players.dropna(subset=["current_rank"]) #remove nan current rank
total_female_players[total_female_players["current_rank"].isna()] # 15 nan in rank
total_female_players = total_female_players.dropna(subset=["current_rank"]) #remove nan current rank
total_female_players["height"] = total_female_players["height"].fillna(total_female_players["height"].mean().round(2)) # fill nan height with mean
total_male_players["height"] = total_male_players["height"].fillna(total_male_players["height"].mean().round(2)) # fill nan height with mean

# find correlations
print("Male correlation between height ang rank: ",total_male_players["height"].corr(total_male_players["current_rank"]))
print("Female correlation between height ang rank: ",total_female_players["height"].corr(total_female_players["current_rank"]))

Male correlation between height ang rank:  -0.11480808221589986
Female correlation between height ang rank:  -0.05487203884108093

In [283]:
# Q11 What is the average duration of matches?
time_df["sum_of_durations"] = (time_df["period_1"].fillna(0) + time_df["period_2"].fillna(0) + time_df["period_3"].fillna(0) +
                            time_df["period_4"].fillna(0) + time_df["period_5"].fillna(0)) # sum all durations 
print(f"The average duration of matches is {np.divide(time_df["sum_of_durations"].mean(),60).round(2)} minutes.")

The average duration of matches is 42.05 minutes.

In [335]:
# Q12 What is the average number of games per set in men's matches compared to women's matches?
match_game_num = tennis_power_df[["match_id","set_num"]].groupby(["match_id","set_num"]).agg(games=("set_num","count")) # find games per set
total_players = pd.merge(home_team_df[["match_id", "gender"]], away_team_df[["match_id", "gender"]], how="outer") # find all players
total_players = pd.merge(match_game_num, total_players, on="match_id") #find gender of player per match 

sum_of_male_games = total_players[total_players["gender"] == "M"]["games"].sum()
sum_of_male_sets = total_players[total_players["gender"] == "M"]["games"].count()
male_games_per_set = np.divide(sum_of_male_games, sum_of_male_sets).round(2)
print(f"Average games per sets for male is: {male_games_per_set}")

sum_of_female_games = total_players[total_players["gender"] == "F"]["games"].sum()
sum_of_female_sets = total_players[total_players["gender"] == "F"]["games"].count()
female_games_per_set = np.divide(sum_of_female_games, sum_of_female_sets).round(2)
print(f"Average games per sets for female is: {female_games_per_set}")

Average games per sets for male is: 9.12
Average games per sets for female is: 8.79

In [ ]:
# Q13